doc/s-sql-d.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-01-04 Thu 08:58 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples D</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples D</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9f48835">S-SQL Examples Home Page</a></li>
<li><a href="#data-types">Data-types</a>
<ul>
<li><a href="#numbers">Numbers</a></li>
<li><a href="#local-time">Timestamps with the local-time package</a></li>
<li><a href="#default-timestamps">Default with no timezone or offset:</a></li>
<li><a href="#cl-postgres-datetime">cl-postgres-datetime</a></li>
</ul>
</li>
<li><a href="#delete">Delete</a></li>
<li><a href="#desc">Desc</a></li>
<li><a href="#distinct">Distinct</a></li>
<li><a href="#distinct-on">Distinct On</a></li>
<li><a href="#doquery">Doquery</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org9f48835" class="outline-2">
<h2 id="org9f48835"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org9f48835">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-data-types" class="outline-2">
<h2 id="data-types">Data-types</h2>
<div class="outline-text-2" id="text-data-types">
<p>
I would note that if you are using insert-dao or update-dao, certain col-types will be enforced and throw errors. For example, smallint and boolean will throw errors if not provided the correct value types. Double-float will throw errors if provided a string. On the other hand, string will quite happily take an integer and and insert it into your database as a string. Providing a col-type of bpchar to some slot, even though postgresql will think that you want a single character, will not throw an error if you provide a string longer than a single character.
</p>
</div>

<div id="outline-container-numbers" class="outline-3">
<h3 id="numbers">Numbers</h3>
<div class="outline-text-3" id="text-numbers">
<p>
Remember the test table from the introduction? It has a timestamp with timezone field called "date", a numeric field called "number-test" and a money field called "money".
</p>

<p>
Lisp has a ratio datatype. In other words, instead of trying to come up with a floating point number for 1/3, common lisp simply views it as 1/3. But how does that translate into storage in postgresql?
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'test <span class="org-builtin">:set</span> 'id 1 'number-test (/ 1 3) 'text <span class="org-string">"one third"</span>))

(query (<span class="org-builtin">:select</span> 'number-test <span class="org-builtin">:from</span> 'test <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id 1)) <span class="org-builtin">:single</span>)

3333333333333333333333333333333333333/10000000000000000000000000000000000000
</pre>
</div>
<p>
We inserted a ratio 1/3 into the numeric field, then got something back that was not quite the same, but is decimal ratio truncated at 37 decimal points.
</p>

<p>
Now insert that same ratio into the money field.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'test <span class="org-builtin">:set</span> 'id 1 'money (/ 1 3) 'text <span class="org-string">"one third money"</span>))

(query (<span class="org-builtin">:select</span> 'money <span class="org-builtin">:from</span> 'test <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id 1)) <span class="org-builtin">:single</span>)

<span class="org-string">"$0.33"</span>
</pre>
</div>
<p>
Here you notice that you got back a string that looks like a number truncated at two decimal points (the pennies). You would have to convert it to something else in order to perform any mathematical calculations.
</p>

<p>
So, for example, you might reach for the wu-decimal package or the decimals package and call wu-decimal:parse-decimal or decimals:parse-decimal-number like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(wu-decimal:parse-decimal <span class="org-string">"$0.33"</span> <span class="org-builtin">:start</span> 1)

33/100
</pre>
</div>

<p>
Notice that we tried to start at 1 in order to get rid of the monetary indicator at the front. However, that doesn't work if the number was negative. Better is just removing the monetary indicator.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(wu-decimal:parse-decimal (remove #\$ <span class="org-string">"-$0.33"</span>))

-33/100
</pre>
</div>

<p>
or, using the decimals package:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(decimals:parse-decimal-number (remove #\$ <span class="org-string">"-$0.33"</span>))

-33/100
</pre>
</div>
</div>
</div>


<div id="outline-container-local-time" class="outline-3">
<h3 id="local-time">Timestamps with the local-time package</h3>
<div class="outline-text-3" id="text-local-time">
<p>
Postgresql keeps everything in a single timezone - UTC. Then everything else is set using the offset. See, e.g. <a href="http://www.postgresql.org/docs/current/datatype-datetime.html">http://www.postgresql.org/docs/current/datatype-datetime.html</a>
</p>

<p>
"For timestamp with time zone, the internally stored value is always in UTC (Universal Coordinated Time, traditionally known as Greenwich Mean Time, GMT). An input value that has an explicit time zone specified is converted to UTC using the appropriate offset for that time zone. If no time zone is stated in the input string, then it is assumed to be in the time zone indicated by the system's timezone parameter, and is converted to UTC using the offset for the timezone zone.
</p>

<p>
When a timestamp with time zone value is output, it is always converted from UTC to the current timezone zone, and displayed as local time in that zone. To see the time in another time zone, either change timezone or use the AT TIME ZONE construct."
</p>

<p>
So, looking at a server that is set for PDT, for table test with fields id, date, number_test, money and text
</p>
</div>
</div>

<div id="outline-container-default-timestamps" class="outline-3">
<h3 id="default-timestamps">Default with no timezone or offset:</h3>
<div class="outline-text-3" id="text-default-timestamps">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'test <span class="org-builtin">:set</span> 'id 3 'text <span class="org-string">"insert here"</span>
                     'date (local-time:encode-timestamp 0 0 0 12 01 01 2013)))

2013-01-01 12:00:00-08
</pre>
</div>
<p>
(looking at the default timezone for the server, postgresql has set the timezone to UTC less 8 hours - UTC time would be 04:00:00)
</p>

<p>
Using offset to explicitly offset 1 hour from UTC (e.g. Paris)
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'test
        <span class="org-builtin">:set</span> 'id 4 'text <span class="org-string">"offset 1 hour"</span>
                     'date (local-time:encode-timestamp 0 0 0 12 01 01 2013
                                                        <span class="org-builtin">:offset</span> 3600)))

2013-01-01 03:00:00-08
</pre>
</div>

<p>
(looking at the default timezone for the server, postgresql has kept the timezone as PDT - UTC less 8 hours - but set the time as 03:00:00, which is 1 hour ahead of UTC)
</p>

<p>
Using timezone to explicitly set it for UTC
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'test
        <span class="org-builtin">:set</span> 'id 5 'text <span class="org-string">"insert here using timezone utc"</span>
                     'date (local-time:encode-timestamp 0 0 0 12 01 01 2013
                                                        <span class="org-builtin">:timezone</span> local-time::+utc-zone+)))

2013-01-01 04:00:00-08
</pre>
</div>
<p>
(looking at the default timezone for the server, postgresql has kept the timezone as PDT - UTC less 8 hours - but set the time as 04:00:00, which is the time in UTC relative to the PDT time at the server.
</p>

<p>
See Time Functions for information on specific functions dealing with time.
</p>
</div>
</div>

<div id="outline-container-cl-postgres-datetime" class="outline-3">
<h3 id="cl-postgres-datetime">cl-postgres-datetime</h3>
<div class="outline-text-3" id="text-cl-postgres-datetime">
<p>
Personally I like using <a href="https://github.com/chaitanyagupta/cl-postgres-datetime">cl-postgres-datetime</a>.
Why? cl-postgres-datetime provides date/time integration for cl-postgres. It uses local-time for types that use time zones (i.e. timestamptz) and simple-date for types that don't (i.e. timestamp, date, time, interval).
</p>
</div>
</div>
</div>

<div id="outline-container-delete" class="outline-2">
<h2 id="delete">Delete</h2>
<div class="outline-text-2" id="text-delete">
<p>
A simple delete example using s-sql:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:delete-from</span>  'countries <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id 284)))
</pre>
</div>
<p>
Slightly more complicated versions:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:delete-from</span> 'cd.members
        <span class="org-builtin">:where</span> (<span class="org-builtin">:not</span> (<span class="org-builtin">:in</span> 'memid (<span class="org-builtin">:select</span> 'memid <span class="org-builtin">:from</span> 'cd.bookings)))))

(query (<span class="org-builtin">:delete-from</span> (<span class="org-builtin">:as</span> 'cd.members 'mems)
        <span class="org-builtin">:where</span> (<span class="org-builtin">:not</span> (<span class="org-builtin">:exists</span> (<span class="org-builtin">:select</span> 1
                               <span class="org-builtin">:from</span> 'cd.bookings
                               <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'memid 'mems.memid))))))
</pre>
</div>
<p>
The following example shows the application of the :using option:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:delete-from</span> 'members
        <span class="org-builtin">:using</span> 'producers
        <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'members.id 'producers.id)
                     (<span class="org-builtin">:=</span> 'members.name <span class="org-string">"Steve"</span>))))

(sql (<span class="org-builtin">:delete-from</span> 'members
      <span class="org-builtin">:using</span> 'producers 'films
                   <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'members.id 'producers.id)
                                (<span class="org-builtin">:=</span> 'members.name <span class="org-string">"Steve"</span>)
                                (<span class="org-builtin">:=</span> 'producers.films-id 'films.id)))
</pre>
</div>
</div>
</div>

<div id="outline-container-desc" class="outline-2">
<h2 id="desc">Desc</h2>
<div class="outline-text-2" id="text-desc">
<p>
Normally, the use of :order-by would order the results in ascending order. You can apply :desc to a column and :asc to another column to re-arrange how the order-by rules will work.
</p>
<div class="org-src-container">
<pre class="src src-lisp">    (query (<span class="org-builtin">:order-by</span>
            (<span class="org-builtin">:select</span> 'id 'name <span class="org-builtin">:from</span> 'regions)
            (<span class="org-builtin">:desc</span> 'id)))

((11 <span class="org-string">"Eastern Europe"</span>) (10 <span class="org-string">"Caribbean"</span>) (9 <span class="org-string">"Pacific"</span>)
 (8 <span class="org-string">"Central Asia"</span>)(7 <span class="org-string">"South America"</span>) (6 <span class="org-string">"North America"</span>)
 (5 <span class="org-string">"Middle East"</span>)(4 <span class="org-string">"Western Europe"</span>) (3 <span class="org-string">"Central America"</span>)
 (2 <span class="org-string">"Asia"</span>) (1 <span class="org-string">"Africa"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-distinct" class="outline-2">
<h2 id="distinct">Distinct</h2>
<div class="outline-text-2" id="text-distinct">
<p>
The Distinct keyword is used to eliminate duplicative rows. In s-sql the keyword :distinct comes after the select arguments and prior to the keyword :from.
</p>

<p>
The postmodern s-sql syntax would look like:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> 'regions.name <span class="org-builtin">:distinct</span>
                <span class="org-builtin">:from</span> 'countries 'regions
                <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:&lt;</span> 'latitude 0)
                             (<span class="org-builtin">:=</span> 'regions.id 'region-id))))

((<span class="org-string">"Pacific"</span>) (<span class="org-string">"Asia"</span>) (<span class="org-string">"Africa"</span>) (<span class="org-string">"South America"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-distinct-on" class="outline-2">
<h2 id="distinct-on">Distinct On</h2>
<div class="outline-text-2" id="text-distinct-on">
<p>
As indicated in the <a href="https://www.postgresql.org/docs/current/sql-select.html">postgresql documentation</a>, the DISTINCT ON clause is not part of the sql standard. A set of rows for which all the expressions are equal are considered duplicates and only the first row of the set is kept. This is a convenience but can have indeterminate results unless order by is used to ensure that the desired row appears first..
</p>

<p>
The postmodern s-sql syntax would look like:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'name 'region-id <span class="org-builtin">:distinct-on</span> 'region-id
        <span class="org-builtin">:from</span> 'countries))

((165 <span class="org-string">"Gabon"</span> 1) (102 <span class="org-string">"Nepal"</span> 2) (73 <span class="org-string">"Nicaragua"</span> 3) (20 <span class="org-string">"UK"</span> 4)
 (51 <span class="org-string">"Egypt"</span> 5) (166 <span class="org-string">"Greenland"</span> 6) (75 <span class="org-string">"Honduras"</span> 7)
 (184 <span class="org-string">"Turkmenistan"</span> 8)(108 <span class="org-string">"Papua New Guinea"</span> 9)
 (121 <span class="org-string">"Antigua"</span> 10) (67 <span class="org-string">"Belarus"</span> 11))

(query (<span class="org-builtin">:order-by</span>
        (<span class="org-builtin">:select</span> 'location 'time 'report
         <span class="org-builtin">:distinct-on</span> 'location
         <span class="org-builtin">:from</span> 'weather-reports)
        'location  (<span class="org-builtin">:desc</span> 'time)))
</pre>
</div>
</div>
</div>

<div id="outline-container-doquery" class="outline-2">
<h2 id="doquery">Doquery</h2>
<div class="outline-text-2" id="text-doquery">
<p>
As stated in the <a href="postmodern.html">postmodern documentation</a>, doquery allows you to execute the given query (a string or a list starting with a keyword), iterating over the rows in the result. The body will be executed with the values in the row bound to the symbols given in names. To iterate over a parameterised query, one can specify a list whose car is the query, and whose cdr contains the arguments.
</p>

<p>
The following is a toy function which illustrates the point.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">iterate-rows</span> ()
  (<span class="org-keyword">let</span> ((country-names ()))
    (doquery (<span class="org-builtin">:order-by</span> (<span class="org-builtin">:select</span> 'name
                         <span class="org-builtin">:from</span> 'countries)
                        'name)
        (xname)
      (push xname country-names))
    country-names))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>